

set synopsys_auto_setup true

# Formality Setup File
set_svf "/home/IC/Labs/Lab_Formal_2/dft/ALU.svf"

######################## Read Reference technology libs ######################## 
 
set SSLIB "/home/IC/Labs/Lab_Formal_2/std_cells/scmetro_tsmc_cl013g_rvt_ss_1p08v_125c.db"
set TTLIB "/home/IC/Labs/Lab_Formal_2/std_cells/scmetro_tsmc_cl013g_rvt_tt_1p2v_25c.db"
set FFLIB "/home/IC/Labs/Lab_Formal_2/std_cells/scmetro_tsmc_cl013g_rvt_ff_1p32v_m40c.db"

read_db -container Ref [list $SSLIB $TTLIB $FFLIB]

########################  Read Reference Design Files ######################## 
read_verilog -container Ref "/home/IC/Labs/Lab_Formal_2/rtl/ALU_TOP.v"
read_verilog -container Ref "/home/IC/Labs/Lab_Formal_2/rtl/ARITHMETIC_UNIT.v"
read_verilog -container Ref "/home/IC/Labs/Lab_Formal_2/rtl/CMP_UNIT.v"
read_verilog -container Ref "/home/IC/Labs/Lab_Formal_2/rtl/Decoder.v"
read_verilog -container Ref "/home/IC/Labs/Lab_Formal_2/rtl/LOGIC_UNIT.v"
read_verilog -container Ref "/home/IC/Labs/Lab_Formal_2/rtl/mux2X1.v"
read_verilog -container Ref "/home/IC/Labs/Lab_Formal_2/rtl/SHIFT_UNIT.v"

######################## set the top Reference Design ######################## 

set_reference_design ALU_TOP
set_top ALU_TOP

####################### Read Implementation tech libs ######################## 

read_db -container Imp [list $SSLIB $TTLIB $FFLIB]

#################### Read Implementation Design Files ######################## 

read_verilog -container Imp -netlist "/home/IC/Labs/Lab_Formal_2/dft/ALU_dft.v"

####################  set the top Implementation Design ######################

set_implementation_design ALU_TOP
set_top ALU_TOP

############################### Don't verify #################################

# do not verify scan out port as a compare point as it is existed only after synthesis and not existed in the RTL
#scan_out
set_dont_verify_points -type port Ref:/WORK/*/SO
set_dont_verify_points -type port Imp:/WORK/*/SO

############################### contants #####################################

# all atpg enable(test_mode, scan_enable) are zero during formal compare

#test_mode
set_constant Ref:/WORK/*/test_mode 0
set_constant Imp:/WORK/*/test_mode 0

#scan_enable
set_constant Ref:/WORK/*/SE 0
set_constant Imp:/WORK/*/SE 0

######################## matching Compare points #############################

match

################################### verify ################################### 

set successful [verify]
if {!$successful} {
diagnose
analyze_points -failing
}

############################### Reporting ####################################
report_passing_points > "passing_points.rpt"
report_failing_points > "failing_points.rpt"
report_aborted_points > "aborted_points.rpt"
report_unverified_points > "unverified_points.rpt"


start_gui
